app/views/users/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]
---
  <ul class="task-list-group">
    <% Task.where(user_id: session_user.id).each do |task| %>