app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "austinkading@gmail"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:login][:email])