app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    redirect_to @task.save ? root_path : new_task_path
---
INSERT INTO "tasks" ("submitted_task", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["submitted_task", "This is not a task!"], ["user_id", 2], ["created_at", 2017-02-09 18:49:06 UTC], ["updated_at", 2017-02-09 18:49:06 UTC]]

  def index
    @user_tasks = session_logged_in? ? Task.where(user_id:  session_user.id).last(10) : nil
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]

    task = Task.find(task_id)
    Task.update(task_id, :completed => !task.completed)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", 2017-02-10 21:00:37 UTC], ["id", 2]]