app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = user_params[:password_digest]
    @user.timer_count = 0
      if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "timer_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])
    p @user
    if request.xhr?
      @user.timer_count += 1
      @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "timer_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["timer_count", 1], ["updated_at", 2017-02-10 20:29:25 UTC], ["id", 2]]